# **Assignment**

**Question1 - Import pandas, matplotlib and numpy libraries and load titanic (titanic.csv) data set as ‘Titanic’.**

In [1]:
from pandas import *
from matplotlib import *
from numpy import *

url = 'https://raw.githubusercontent.com/RavinderSBawa/DS/master/titanic_train-1.csv'
Titanic=read_csv(url)

Titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**Question2 - Display the all the columns present in the Titanic data-set and print the columns name.**

In [2]:
print('Columns present in Titanic data-set are ',Titanic.keys().values)

Columns present in Titanic data-set are  ['PassengerId' 'Survived' 'Pclass' 'Name' 'Sex' 'Age' 'SibSp' 'Parch'
 'Ticket' 'Fare' 'Cabin' 'Embarked']

**Question3 - Display which columns have NAn values.**

In [3]:
Titinac_NaN=Titanic.columns[Titanic.isnull().any()]
print('Columns have Nan values are ',Titinac_NaN.values)

Columns have Nan values are  ['Age' 'Cabin' 'Embarked']

**End of Assignment.**